#!/usr/bin/env python
# encoding: utf-8

'''
题目:企业发放的奖金根据利润提成。利润(I) :
    低于或等于 10 万元时,奖金可提 10% ;
    高于10万元,低于20万元时,低于10万元的部分按 10% 提成,高于 10万元的部分,可提成7.5%;
    20 万到 40 万之间时,高于 20 万元的部分,可提成 5% ;
    40 万到 60 万之间时,高于 40 万元的部分,可提成 3% ;
    60 万到 100 万之间时,高于 60 万元的部分,可提成1.5%,
    高于 100 万元时,超过 100 万元的部分按 1% 提成,
    从键盘输入当月利润 I ,求应发放奖金总数?
'''

I = int(input('输入利润: '))
def func(I):
    if 0< I <= 100000:
        res = I * 0.1
    elif 100000 < I < 200000:
        res = (I - 100000) * 0.075 + 100000 * 0.1
    elif 200000 < I < 400000:
        res = (I - 200000) * 0.05 + 200000 * 0.075 + 100000 * 0.1
    elif 400000 < I < 600000:
        res = (I -400000) * 0.03 + 300000 * 0.05 + 200000 * 0.075 + 100000 * 0.1
    elif 600000 < I < 1000000:
        res = (I - 6000000) * 0.015 + 400000 * 0.03 +300000 * 0.05 + 200000 * 0.075 + 100000 * 0.1
    else:
        res = (I - 1000000) * 0.01 + 6000000 * 0.015 + 400000 * 0.03 +300000 * 0.05 + 200000 * 0.075 + 100000 * 0.1
    print(res)

func(I)
